---
title: PlanCircuitSet
classe: Autodesk.Revit.DB.PlanCircuitSet
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# PlanCircuitSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `planCircuitSet.IsEmpty` | Boolean |
| `Int32 Size { get; }` | `planCircuitSet.Size` | Int32 |
| `Void Clear()` | `planCircuitSet.Clear()` | Void |
| `Boolean Contains(PlanCircuit)` | `planCircuitSet.Contains(item)` | Boolean |
| `Int32 Erase(PlanCircuit)` | `planCircuitSet.Erase(item)` | Int32 |
| `PlanCircuitSetIterator ForwardIterator()` | `planCircuitSet.ForwardIterator()` | PlanCircuitSetIterator |
| `IEnumerator GetEnumerator()` | `planCircuitSet.GetEnumerator()` | IEnumerator |
| `Boolean Insert(PlanCircuit)` | `planCircuitSet.Insert(item)` | Boolean |
| `PlanCircuitSetIterator ReverseIterator()` | `planCircuitSet.ReverseIterator()` | PlanCircuitSetIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```